# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [5]:
import pandas as pd

### Step 2. Create the DataFrame with the following values:

In [11]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns=raw_data.keys())

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [12]:
df

   company    regiment      name  postTestScore  preTestScore
0      1st  Nighthawks    Miller             25             4
1      1st  Nighthawks  Jacobson             94            24
2      2nd  Nighthawks       Ali             57            31
3      2nd  Nighthawks    Milner             62             2
4      1st    Dragoons     Cooze             70             3
5      1st    Dragoons     Jacon             25             4
6      2nd    Dragoons    Ryaner             94            24
7      2nd    Dragoons      Sone             57            31
8      1st      Scouts     Sloan             62             2
9      1st      Scouts     Piger             70             3
10     2nd      Scouts     Riani             62             2
11     2nd      Scouts       Ali             70             3

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [9]:
meanNight = df[df["regiment"] == "Nighthawks"].preTestScore.mean()
meanNight

15.25

### Step 5. Present general statistics by company

In [18]:
gb = df.groupby("company")
gb.describe()

        postTestScore                                                       \
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

        preTestScore
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

### Step 6. What is the mean each company's preTestScore?

In [19]:
gb.preTestScore.mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Step 7. Present the mean preTestScores grouped by regiment and company

In [27]:
df.groupby(['regiment', 'company']).preTestScore.mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [28]:
df.groupby(['regiment', 'company']).preTestScore.mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

### Step 9. Group the entire dataframe by regiment and company

In [30]:
df.groupby(['regiment', 'company']).mean()

                    postTestScore  preTestScore
regiment   company
Dragoons   1st               47.5           3.5
           2nd               75.5          27.5
Nighthawks 1st               59.5          14.0
           2nd               59.5          16.5
Scouts     1st               66.0           2.5
           2nd               66.0           2.5

### Step 10. What is the number of observations in each regiment and company

In [33]:
df.groupby(['regiment', 'company']).count()

                    name  postTestScore  preTestScore
regiment   company
Dragoons   1st         2              2             2
           2nd         2              2             2
Nighthawks 1st         2              2             2
           2nd         2              2             2
Scouts     1st         2              2             2
           2nd         2              2             2

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [37]:
for name, groupby in df.groupby('regiment'):
    print(name)
    print(groupby)

Dragoons
  company  regiment    name  postTestScore  preTestScore
4     1st  Dragoons   Cooze             70             3
5     1st  Dragoons   Jacon             25             4
6     2nd  Dragoons  Ryaner             94            24
7     2nd  Dragoons    Sone             57            31
Nighthawks
  company    regiment      name  postTestScore  preTestScore
0     1st  Nighthawks    Miller             25             4
1     1st  Nighthawks  Jacobson             94            24
2     2nd  Nighthawks       Ali             57            31
3     2nd  Nighthawks    Milner             62             2
Scouts
   company regiment   name  postTestScore  preTestScore
8      1st   Scouts  Sloan             62             2
9      1st   Scouts  Piger             70             3
10     2nd   Scouts  Riani             62             2
11     2nd   Scouts    Ali             70             3